{
  "backend/main.mo": "Motoko canister managing user profiles with access control plus public message submission and admin-only message retrieval.",
  "feature_evidence.json": "Feature evidence report describing an image asset update and associated frontend file impact.",
  "frontend-file-summaries.txt": "List of pre-generated short summaries for various frontend files used in the project.",
  "frontend/DEPLOYMENT.md": "Guide describing prerequisites and steps for deploying the app locally or on the Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind-based styling with extensive CSS variable definitions for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app configuring layout and routing for home and listen pages using TanStack Router.",
  "frontend/src/components/contact/ContactForm.tsx": "React contact form with validation, backend submission via actor, and success UI handling.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Footer component with navigation shortcuts, social links, smart section scrolling, and Listen page navigation.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Responsive header with scroll detection, navigation buttons, social links, and logic to scroll or navigate to sections/pages.",
  "frontend/src/components/sections/AboutSection.tsx": "About section displaying artist name, portrait, and bio text split into paragraphs.",
  "frontend/src/components/sections/BiographySection.tsx": "Biography section showing narrative text and a milestones timeline sourced from artistContent.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with a heading, description, and embedded ContactForm component.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, artist name, tagline, and buttons that scroll to shows or contact sections.",
  "frontend/src/components/sections/MusicSection.tsx": "Music section listing tracks with external Spotify links and CTAs for the listen page and full discography.",
  "frontend/src/components/sections/SectionChrome.tsx": "Simple wrapper component adding an id and optional styling around section content.",
  "frontend/src/components/sections/ShowsSection.tsx": "Shows section displaying formatted upcoming and past shows with ticket links and location details.",
  "frontend/src/components/sections/VideosSection.tsx": "Videos section embedding YouTube videos from artistContent and linking to the YouTube channel.",
  "frontend/src/content/artistContent.ts": "Defines artist metadata, biography, social links, and track lists for use across the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Exposes a mutation hook for submitting contact messages through the backend actor and invalidates message queries on success.",
  "frontend/src/index.css": "Defines global Tailwind base styles, CSS variables, theming, and typography for the frontend.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider before rendering the root component.",
  "frontend/src/pages/ListenPage.tsx": "Renders a listening page with embedded track players, track metadata, and Spotify link using artist content.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters, including support for hash-based routing and session persistence.",
  "frontend/tailwind.config.js": "TailwindCSS configuration enabling dark mode, content scanning, extended colors, fonts, animations, and custom theming.",
  "project_state.json": "Project state metadata defining current features, pending requests, and overall project configuration for adding an uploaded photo."
}