{
  "backend/main.mo": "Motoko canister providing user profile management with authorization checks and a public contact form plus admin-only message viewing.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short functional descriptions for build planning.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites and steps for local and mainnet deployment on the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, theming variables, and base styles including dark mode overrides.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, shared layout, and section-based home page.",
  "frontend/src/components/contact/ContactForm.tsx": "React contact form with validation and backend submission via actor and mutation hooks.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Footer component with branding, navigation links, social icons, and smart home/section navigation.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Responsive header with scroll effects, navigation links, social icons, and logic to scroll or navigate to sections/pages.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section using artist bio content split into paragraphs.",
  "frontend/src/components/sections/BiographySection.tsx": "Displays a biography section with narrative paragraphs and a milestones timeline sourced from artist content.",
  "frontend/src/components/sections/ContactSection.tsx": "Shows a contact section with a brief intro and embedded contact form.",
  "frontend/src/components/sections/HeroSection.tsx": "Full‑screen hero section with background image, artist name, tagline, and buttons that scroll to other sections.",
  "frontend/src/components/sections/MusicSection.tsx": "Lists tracks with Spotify links, includes a CTA to the listen page, and links to full discography.",
  "frontend/src/components/sections/SectionChrome.tsx": "Wrapper component that renders a section element with an id and optional styling.",
  "frontend/src/components/sections/ShowsSection.tsx": "Displays upcoming and past shows with formatted dates and ticket links.",
  "frontend/src/components/sections/VideosSection.tsx": "Renders a grid of embedded YouTube videos with titles and a link to the full YouTube channel.",
  "frontend/src/content/artistContent.ts": "Defines detailed artist metadata including bio, milestones, social links, and track lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication and status.",
  "frontend/src/hooks/useQueries.ts": "Implements a mutation hook to submit contact messages through the backend actor and invalidate related queries.",
  "frontend/src/index.css": "Configures Tailwind styles, CSS variables, themes, and global typography/background settings.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ListenPage.tsx": "Renders a music listening page with track embeds, back navigation, and a Spotify link.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, animations, custom OKLCH color tokens, fonts, shadows, and component keyframes.",
  "project_state.json": "Defines the project’s state, including artist website details, feature requirements, known issues, and pending feature requests."
}